
// Задачи 1

// Рост каждого из 22 учеников класса представлен в виде 
// массива. Определить количество учеников, рост которых не пре-
// вышает значения r.

let heights = [
	100, 110, 120, 130, 140, 160, 
	180, 200, 210, 148, 139, 165, 
	163, 178, 170, 154, 149, 158,
	199, 235, 289, 267
]

let r = 140
let col = 0
for(let i = 0; i < heights.length; i++){
    if(heights[i] <= r){
        col++
    }
}

console.log(col)





// Задачи 2
// Найти число пар соседних элементов массива, оканчи-
// вающихся нулем.

// let arrs = [
// 	19, 10, 80, 0, 90, 23, 
// 	90, 20, 40, 55, 78, 90, 0
// ]

// let b = 0; 

// for (let i = 1; i < arrs.length; i++) {
// 	if(arrs[i] == 0) {
//         b++
//     }
// }

// console.log(b)





// Задачи 3
// Дан массив из 26 элементов. Найти пять соседних элементов, 
// сумма значений которых максимальна.

// let arrs = [
// 	50, -71, 45, 10, 17, 1,
// 	0, 45, -34, 45, 0, 7,
// 	50, 20, -20.39, 45, 55.66, 67,
// 	240, -139, 45, 90, 600, -239.45
// ]



// let couple = [] 
// let maxCouple;

// for (let i = 1; i < arrs.length; i++) {
// 	console.log(arrs[i - 1] + arrs[i]);
// }

